In [1]:
import pandas as pd 
import numpy as np
pd.__version__ # know the pandas version

'2.0.3'

In [2]:
s=pd.Series([1,2,3,]) # one column
print(s)

0    1
1    2
2    3
dtype: int64

In [4]:
df=pd.DataFrame({
    "name": ["rams","prash"],
    "age":[12,34]})
df

    name  age
0   rams   12
1  prash   34

# Reading data

In [5]:
df=pd.read_csv(r"C:\Users\prashanthi\Downloads\data.csv")

In [6]:
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,NaN
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97.0
2,J.Ramya,AIR,NaN,52,jivvireddyramyasri@gmailcom,9676976652,NaN
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85.0
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96.0
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90.0
6,Y.Kaveri,AIR,NaN,3,yendamurikaveri@gmail.com,7386015549,NaN
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89.0
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90.0
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,NaN

# writing the data into files

In [7]:
df.to_csv('data.csv',index=False)

# exploring data

In [8]:
df.head()

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,NaN
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97.0
2,J.Ramya,AIR,NaN,52,jivvireddyramyasri@gmailcom,9676976652,NaN
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85.0
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96.0

In [9]:
df.tail()

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90.0
6,Y.Kaveri,AIR,NaN,3,yendamurikaveri@gmail.com,7386015549,NaN
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89.0
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90.0
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,NaN

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   NAME                  10 non-null     object
 1   CLASS                 10 non-null     object
 2   SECTION               8 non-null      object
 3   ROLLNO                10 non-null     int64
 4                  EMAIL  10 non-null     object
 5   PHNO                  10 non-null     int64
 6   MARKS                 6 non-null      float64
dtypes: float64(1), int64(2), object(4)
memory usage: 692.0+ bytes

In [12]:
df.shape

(10, 7)

In [13]:
df[2:5]

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
2,J.Ramya,AIR,NaN,52,jivvireddyramyasri@gmailcom,9676976652,NaN
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85.0
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96.0

In [14]:
df.columns

Index(['NAME', 'CLASS', 'SECTION', 'ROLLNO', '               EMAIL', 'PHNO',
       'MARKS'],
      dtype='object')

In [16]:
df.NAME

0          B.Yamuna
1            P.Devi
2          J.Ramya
3       K.Prasanthi
4     K.V. Niharika
5    K.Sri Niharika
6          Y.Kaveri
7           P.Durga
8          P.Akhila
9         P.Neelima
Name: NAME, dtype: object

In [18]:
df['NAME'].max()

'Y.Kaveri'

In [19]:
df['NAME'].min()

'B.Yamuna'

In [20]:
df['MARKS'].mean()

91.16666666666667

In [21]:
df['NAME'].describe()

count           10
unique          10
top       B.Yamuna
freq             1
Name: NAME, dtype: object

In [22]:
df[df.NAME==df.NAME.max()]

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
6,Y.Kaveri,AIR,NaN,3,yendamurikaveri@gmail.com,7386015549,NaN

In [23]:
df.MARKS[df.NAME==df.NAME.max()]

6   NaN
Name: MARKS, dtype: float64